app/controllers/sessions_controller.rb

INSERT INTO "users" ("provider", "uid", "nickname", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    user = User.find_or_create_from_auth_hash(request.env['omniauth.auth'])